---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.PatternJustification.End
enum: Autodesk.Revit.DB.Architecture.PatternJustification
source: html/84331a13-d499-65fa-8d6c-75a83ee3cb42.htm
---
# Autodesk.Revit.DB.Architecture.PatternJustification.End

Patterns are distributed starting from the ending of a railing path.